#pragma once

// PavlovVR (Dumped by Hinnie) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// AnimBlueprintGeneratedClass ZMale_AnimBlueprint.ZMale_AnimBlueprint_C
// 0x1468 (0x1848 - 0x03E0)
class UZMale_AnimBlueprint_C : public UZAnimInstance
{
public:
	struct FPointerToUberGraphFrame                    UberGraphFrame;                                           // 0x03E0(0x0008) (ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                              AnimGraphNode_Root_E28A294B46A3B9CAD9009F8ABA7E698E;      // 0x03E8(0x0040)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_F731BE2042AFF45C7E98E0A5D06BF44F;// 0x0428(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_586F142544E9C55F1D658E9C7A7B9006;// 0x0470(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_A48B4FA2419CCDE96A5F399DFB86BABC;// 0x04B8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_FBAF2A3C40CAE46158CB2ABA4297A96A;// 0x0500(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9D739B3D4990E1277AA9E9BCEB6AEC5F;// 0x0548(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_4D9C9F304FE53BE07402ED98BC535983;// 0x05E8(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_EFAD8D8C406583DC0283679E184FA2AF;// 0x0628(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_ACE4181E4AF06396836100B0A7F1DA88;// 0x06C8(0x0040)
	struct FAnimNode_RandomPlayer                      AnimGraphNode_RandomPlayer_42284971416E760633588DAEADB7B065;// 0x0708(0x0090)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_E81B36204285D4BA92BBFEA0B193A5C4;// 0x0798(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_8D83DF114D650ED8A3DCA1A08A192095;// 0x07D8(0x00E0)
	struct FAnimNode_LayeredBoneBlend                  AnimGraphNode_LayeredBoneBlend_281BB2A740748B2BF47B7FA6612ADB20;// 0x08B8(0x00D8)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_0561D86D4A8C712F9895F48ABF165F2B;// 0x0990(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_B10D62604456A41D6E915AA679579F08;// 0x09D8(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_13F2CC6D47F83641D21F0DA3C8BCB2C2;// 0x0A20(0x0048)
	struct FAnimNode_TransitionResult                  AnimGraphNode_TransitionResult_6556509D46818C027ADBC4B726438DC0;// 0x0A68(0x0048)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_D2A8B3A245476B4D300EF09DDB1C118F;// 0x0AB0(0x00A0)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_EC41A89E40B2D680AD40818910E43E55;// 0x0B50(0x0138)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_538CD15E4930380E328A128FF825C70F;// 0x0C88(0x0040)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_8C1AB63C4E4D244483A614A6F2B1A495;// 0x0CC8(0x0040)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_DE9AB98E495D75F9896A83B5841A5AE5;// 0x0D08(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_F43BAFE54F0991F676D3D5B8FF4A674E;// 0x0D48(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_1FD6C45C46C27E56E4375E954F8862C9;// 0x0D88(0x0138)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_F3BD94B747D342A693221488DBAE8A26;// 0x0EC0(0x0040)
	struct FAnimNode_BlendSpacePlayer                  AnimGraphNode_BlendSpacePlayer_B10E744A4089DC67E21481BD286FAA53;// 0x0F00(0x0128)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_05C517C849A2E6840CDFAD88F5943948;// 0x1028(0x0040)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_DC996096424B5578B5E3A7A6ADE93858;// 0x1068(0x0040)
	struct FAnimNode_ModifyBone                        AnimGraphNode_ModifyBone_CFC8C8934062F6EF9B2801BCBB2AAE93;// 0x10A8(0x0138)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_C84DF48B40D9DA490BA04DB3C0701775;// 0x11E0(0x0040)
	struct FAnimNode_SequencePlayer                    AnimGraphNode_SequencePlayer_9E71223A406526519CD197B2B1CD65B6;// 0x1220(0x00A0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_D2BF39C5489FFFEB23F4E1ADEB0FD306;// 0x12C0(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_AE9DCA0249BE246BF5D27D83F361807F;// 0x1300(0x00E0)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_A7009FAE42F9A7238A68CD87CA251A90;// 0x13E0(0x0040)
	struct FAnimNode_StateResult                       AnimGraphNode_StateResult_EA44B7254E888D14047D91AA5B9210D2;// 0x1420(0x0040)
	struct FAnimNode_StateMachine                      AnimGraphNode_StateMachine_C3756A51484A3EE6A59F948BF23D7455;// 0x1460(0x00E0)
	struct FAnimNode_ConvertLocalToComponentSpace      AnimGraphNode_LocalToComponentSpace_2215866B478ACFB218257F92699753BD;// 0x1540(0x0040)
	struct FAnimNode_LookAt                            AnimGraphNode_LookAt_97BBFD45428F419C257A458C0B024E09;    // 0x1580(0x0220)
	struct FAnimNode_ConvertComponentToLocalSpace      AnimGraphNode_ComponentToLocalSpace_DA6CC4FA4133AF48943E8A932850230A;// 0x17A0(0x0040)
	struct FAnimNode_Slot                              AnimGraphNode_Slot_531824A54BE3B2E347915A8374056831;      // 0x17E0(0x0068)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("AnimBlueprintGeneratedClass ZMale_AnimBlueprint.ZMale_AnimBlueprint_C");
		return ptr;
	}


	void EvaluateGraphExposedInputs_ExecuteUbergraph_ZMale_AnimBlueprint_AnimGraphNode_SequencePlayer_9E71223A406526519CD197B2B1CD65B6();
	void ExecuteUbergraph_ZMale_AnimBlueprint(int EntryPoint);
};


}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
