#pragma once

// PavlovVR (Dumped by Hinnie) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class VRFramework.VRAvatarAnimInstance
// 0x0140 (0x04A0 - 0x0360)
class UVRAvatarAnimInstance : public UAnimInstance
{
public:
	float                                              SpeedY;                                                   // 0x0360(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bMoving;                                                  // 0x0364(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bFlying;                                                  // 0x0365(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bFalling;                                                 // 0x0366(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bCrouched;                                                // 0x0367(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              SmoothJointExp;                                           // 0x0368(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     LeftHandLocation;                                         // 0x036C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     LeftHandLocationOffset;                                   // 0x0378(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    LeftHandRotation;                                         // 0x0384(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    LeftHandRotationOffset;                                   // 0x0390(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     LeftHandJoint;                                            // 0x039C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     LeftHandJointSmooth;                                      // 0x03A8(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     RightHandLocation;                                        // 0x03B4(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     RightHandLocationOffset;                                  // 0x03C0(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    RightHandRotation;                                        // 0x03CC(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    RightHandRotationOffset;                                  // 0x03D8(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     RightHandJoint;                                           // 0x03E4(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     RightHandJointSmooth;                                     // 0x03F0(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     HeadLocation;                                             // 0x03FC(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    HeadRotation;                                             // 0x0408(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    HeadRotationYawOnly;                                      // 0x0414(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     LookAtLocation;                                           // 0x0420(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LookAtDistance;                                           // 0x042C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              LookAtHeightOffset;                                       // 0x0430(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bDebugLookAt;                                             // 0x0434(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0435(0x0003) MISSED OFFSET
	struct FVector                                     PelvisHeight;                                             // 0x0438(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              PelvisHeightOffset;                                       // 0x0444(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              MinPelvisHeight;                                          // 0x0448(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     EyeLookAtLocation;                                        // 0x044C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              EyeLookAtAlpha;                                           // 0x0458(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x045C(0x0004) MISSED OFFSET
	class USceneComponent*                             EyeLookAtTarget;                                          // 0x0460(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              ChangeTargetInterval;                                     // 0x0468(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              EyeLidRatio;                                              // 0x046C(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UCurveFloat*                                 EyeLidCurve;                                              // 0x0470(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              JawRatio;                                                 // 0x0478(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x4];                                       // 0x047C(0x0004) MISSED OFFSET
	class UCurveFloat*                                 JawOsilationCurve;                                        // 0x0480(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               EyeLidSequence;                                           // 0x0488(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x10];                                      // 0x0490(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRFramework.VRAvatarAnimInstance");
		return ptr;
	}

};


// Class VRFramework.VRAvatarComponent
// 0x0040 (0x0B70 - 0x0B30)
class UVRAvatarComponent : public USkeletalMeshComponent
{
public:
	struct FVector                                     LastLocation;                                             // 0x0B30(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FRotator                                    LastRotation;                                             // 0x0B3C(0x000C) (ZeroConstructor, IsPlainOldData)
	float                                              YawOffset;                                                // 0x0B48(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              FrontalOffset;                                            // 0x0B4C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InterpSpeed;                                              // 0x0B50(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              InterpRotationSpeed;                                      // 0x0B54(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     Velocity;                                                 // 0x0B58(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xC];                                       // 0x0B64(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRFramework.VRAvatarComponent");
		return ptr;
	}

};


// Class VRFramework.VRBulletDamageType
// 0x0000 (0x0040 - 0x0040)
class UVRBulletDamageType : public UDamageType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRFramework.VRBulletDamageType");
		return ptr;
	}

};


// Class VRFramework.VRBullet
// 0x0180 (0x04A8 - 0x0328)
class AVRBullet : public AActor
{
public:
	struct FVRBulletImpactEffect                       DummyFX;                                                  // 0x0328(0x0010) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x24];                                      // 0x0338(0x0024) MISSED OFFSET
	TWeakObjectPtr<class UPrimitiveComponent>          ImpactPrimitive;                                          // 0x035C(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x0364(0x0004) MISSED OFFSET
	struct FVector                                     SpawnLocation;                                            // 0x0368(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     HitLocation;                                              // 0x0374(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class AController*                                 Shooter;                                                  // 0x0380(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UClass*                                      GunClass;                                                 // 0x0388(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class USphereComponent*                            Collision;                                                // 0x0390(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData)
	class USphereComponent*                            BuzzingVolume;                                            // 0x0398(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData)
	class UProjectileMovementComponent*                ProjectileMovement;                                       // 0x03A0(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData)
	bool                                               bPenetrated;                                              // 0x03A8(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bSuppressed;                                              // 0x03A9(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x2];                                       // 0x03AA(0x0002) MISSED OFFSET
	float                                              Damage;                                                   // 0x03AC(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              BlockDamagePercentage;                                    // 0x03B0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bPassiveDamage;                                           // 0x03B4(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x03B5(0x0003) MISSED OFFSET
	float                                              Penetration;                                              // 0x03B8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x03BC(0x0004) MISSED OFFSET
	class UCurveFloat*                                 Falloff;                                                  // 0x03C0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              Drag;                                                     // 0x03C8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bPenetratesThinSurfaces;                                  // 0x03CC(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bShouldSlow;                                              // 0x03CD(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x2];                                       // 0x03CE(0x0002) MISSED OFFSET
	float                                              EffectScale;                                              // 0x03D0(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ImpactForce;                                              // 0x03D4(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MaxLifeSpan;                                              // 0x03D8(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bDeferImpactForce;                                        // 0x03DC(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x3];                                       // 0x03DD(0x0003) MISSED OFFSET
	class USoundCue*                                   BuzzingSound;                                             // 0x03E0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundCue*                                   BuzzingPenetrationSound;                                  // 0x03E8(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundCue*                                   PenetrationSound;                                         // 0x03F0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVRBulletImpactEffect                       DefaultImpactFX;                                          // 0x03F8(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVRBulletImpactEffect                       HeadshotImpactFX;                                         // 0x0408(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVRBulletImpactEffect                       FleshImpactFX;                                            // 0x0418(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVRBulletImpactEffect                       GlassImpactFX;                                            // 0x0428(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVRBulletImpactEffect                       MetalImpactFX;                                            // 0x0438(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVRBulletImpactEffect                       WoodImpactFX;                                             // 0x0448(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVRBulletImpactEffect                       ConcreteImpactFX;                                         // 0x0458(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVRBulletImpactEffect                       CarpetImpactFX;                                           // 0x0468(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVRBulletImpactEffect                       FabricImpactFX;                                           // 0x0478(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVRBulletImpactEffect                       WaterImpactFX;                                            // 0x0488(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVRBulletImpactEffect                       DirtImpactFX;                                             // 0x0498(0x0010) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRFramework.VRBullet");
		return ptr;
	}


	void OnProjectileStop(const struct FHitResult& ImpactResult);
	void OnImpact(const struct FHitResult& Hit);
	void OnBuzzingOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ApplyImpactForce();
};


// Class VRFramework.VRBulletManager
// 0x0000 (0x0328 - 0x0328)
class AVRBulletManager : public AInfo
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRFramework.VRBulletManager");
		return ptr;
	}


	class AVRBulletManager* STATIC_Get(class UObject* WorldContextObject);
};


// Class VRFramework.VRBulletPenetrationInterface
// 0x0000 (0x0028 - 0x0028)
class UVRBulletPenetrationInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRFramework.VRBulletPenetrationInterface");
		return ptr;
	}


	bool IsThinSurface(class UPrimitiveComponent* Component);
};


// Class VRFramework.VRCameraComponent
// 0x0000 (0x0790 - 0x0790)
class UVRCameraComponent : public UCameraComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRFramework.VRCameraComponent");
		return ptr;
	}

};


// Class VRFramework.VRController
// 0x01E8 (0x0510 - 0x0328)
class AVRController : public AActor
{
public:
	class USkeletalMeshComponent*                      Mesh;                                                     // 0x0328(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UMotionControllerComponent*                  MotionController;                                         // 0x0330(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class USphereComponent*                            GrabVolume;                                               // 0x0338(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UPhysicsConstraintComponent*                 GrabConstraint;                                           // 0x0340(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UStaticMeshComponent*                        TeleportMesh;                                             // 0x0348(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UCustomMeshComponent*                        TeleportLineMesh;                                         // 0x0350(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	class UWidgetInteractionComponent*                 Stick;                                                    // 0x0358(0x0008) (Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0360(0x0004) MISSED OFFSET
	struct FVector                                     SmoothVelocity;                                           // 0x0364(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     Velocity;                                                 // 0x0370(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     LastLocation;                                             // 0x037C(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     ThrowVelocity;                                            // 0x0388(0x000C) (ZeroConstructor, IsPlainOldData)
	struct FVector2D                                   TouchPosition;                                            // 0x0394(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x24];                                      // 0x039C(0x0024) MISSED OFFSET
	bool                                               bTeleportEnabled;                                         // 0x03C0(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EVRControllerMode                                  Mode;                                                     // 0x03C1(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bCustomTriggerRatio;                                      // 0x03C2(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bTeleportMode;                                            // 0x03C3(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     TeleportLocation;                                         // 0x03C4(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FRotator                                    TeleportRotation;                                         // 0x03D0(0x000C) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bValidTeleportLocation;                                   // 0x03DC(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x03DD(0x0003) MISSED OFFSET
	class AVRPlayArea*                                 PlayArea;                                                 // 0x03E0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UPrimitiveComponent*                         Grabbed;                                                  // 0x03E8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	bool                                               bGripHoldMode;                                            // 0x03F0(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x03F1(0x0003) MISSED OFFSET
	float                                              TriggerRatio;                                             // 0x03F4(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              GripRatio;                                                // 0x03F8(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              GripForceRatio;                                           // 0x03FC(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bGripped;                                                 // 0x0400(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bTriggered;                                               // 0x0401(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	EControllerHand                                    HandType;                                                 // 0x0402(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData04[0x5];                                       // 0x0403(0x0005) MISSED OFFSET
	class UVRHandleComponent*                          Handle;                                                   // 0x0408(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	bool                                               bPlayAreaTeleportOnly;                                    // 0x0410(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x3];                                       // 0x0411(0x0003) MISSED OFFSET
	struct FVector                                     ParabolaOriginOffset;                                     // 0x0414(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParabolaAngle;                                            // 0x0420(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                ParabolaIterations;                                       // 0x0424(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	int                                                ParabolaSides;                                            // 0x0428(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParabolaRadius;                                           // 0x042C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParabolaDistance;                                         // 0x0430(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ParabolaLag;                                              // 0x0434(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     ThrowOffset;                                              // 0x0438(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x4];                                       // 0x0444(0x0004) MISSED OFFSET
	class UForceFeedbackEffect*                        HapticLeft;                                               // 0x0448(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UForceFeedbackEffect*                        HapticRight;                                              // 0x0450(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UClass*                                      MenuClass;                                                // 0x0458(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MenuSpawnDistance;                                        // 0x0460(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              MenuSpawnHeight;                                          // 0x0464(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundCue*                                   HolsterSound;                                             // 0x0468(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class USoundCue*                                   UnHolsterSound;                                           // 0x0470(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bGenerateQuadrantEvents;                                  // 0x0478(0x0001) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData07[0x7];                                       // 0x0479(0x0007) MISSED OFFSET
	class UHapticFeedbackEffect_Base*                  Button1Haptic;                                            // 0x0480(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UHapticFeedbackEffect_Base*                  Button2Haptic;                                            // 0x0488(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UHapticFeedbackEffect_Base*                  InteractBeginHaptic;                                      // 0x0490(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UHapticFeedbackEffect_Base*                  InteractEndHaptic;                                        // 0x0498(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UHapticFeedbackEffect_Base*                  SlowPulseHaptic;                                          // 0x04A0(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UHapticFeedbackEffect_Base*                  GenericHapticEffect;                                      // 0x04A8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     AvatarHandOffset;                                         // 0x04B0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    AvatarHandRotationOffset;                                 // 0x04BC(0x000C) (Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FScriptMulticastDelegate                    OnGripChanged;                                            // 0x04C8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnTriggerChanged;                                         // 0x04D8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnQuadrantPressed;                                        // 0x04E8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnControllerModeChanged;                                  // 0x04F8(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	bool                                               bInputReady;                                              // 0x0508(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData08[0x7];                                       // 0x0509(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRFramework.VRController");
		return ptr;
	}


	void UnGrab();
	void TriggerChanged(bool bNewTrigger);
	void Teleport();
	void SetPlayArea(class AVRPlayArea* NewPlayArea, bool bTeleport);
	void SetHapticValues(float Amplitude, float Frequency);
	void PrepareTeleport();
	void PlayHapticEffect(class UHapticFeedbackEffect_Base* HapticEffect);
	void PlayHaptic(EVRHapticType Type);
	void OnRep_HandType();
	void OnModeChanged(EVRControllerMode From);
	void OnInvalidTeleportOverlap(class AActor* Actor);
	void OnImminentTeleport();
	void OnGrabVolumeEndOverlapOld(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex);
	void OnGrabVolumeEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex);
	void OnGrabVolumeBeginOverlapOld(class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnGrabVolumeBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnGrabEndOverlap(class UPrimitiveComponent* Component);
	void OnGrabBeginOverlap(class UPrimitiveComponent* Component);
	void GripChanged(bool bNewGrip);
	void GrabManual(class UPrimitiveComponent* Component, bool bByGrip);
	void Grab(bool bByGrip);
	class APlayerController* GetPawnController();
	class AVRPawn* GetPawn();
	EControllerHand GetHandType();
	class UPrimitiveComponent* GetGrabVolume();
	void GenericHaptic();
	void EmulateTrigger(bool bPressed);
	void EmulateMenu(bool bPressed);
	void EmulateGrip(bool bPressed);
	bool CouldGrab();
	void ChangeMode(EVRControllerMode To);
};


// Class VRFramework.VRControllerAnimInstance
// 0x0070 (0x03D0 - 0x0360)
class UVRControllerAnimInstance : public UAnimInstance
{
public:
	class UAnimSequence*                               Sequence;                                                 // 0x0360(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               SequenceOverride;                                         // 0x0368(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              SequenceRatio;                                            // 0x0370(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              TriggerRatio;                                             // 0x0374(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              GripRatio;                                                // 0x0378(0x0004) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bGripped;                                                 // 0x037C(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bRightHand;                                               // 0x037D(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x2];                                       // 0x037E(0x0002) MISSED OFFSET
	struct FVector                                     HeadLocation;                                             // 0x0380(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     ShoulderLocation;                                         // 0x038C(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     JointLocation;                                            // 0x0398(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FVector                                     Scale;                                                    // 0x03A4(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UAnimSequence*                               DefaultSequence;                                          // 0x03B0(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     ShoulderOffset;                                           // 0x03B8(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FVector                                     JointOffset;                                              // 0x03C4(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRFramework.VRControllerAnimInstance");
		return ptr;
	}

};


// Class VRFramework.VRDynamicHelperComponent
// 0x0060 (0x0150 - 0x00F0)
class UVRDynamicHelperComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x30];                                      // 0x00F0(0x0030) MISSED OFFSET
	class UStaticMeshComponent*                        DynamicMesh;                                              // 0x0120(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UPrimitiveComponent*                         Component;                                                // 0x0128(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FName                                       ComponentName;                                            // 0x0130(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bReplaceMesh;                                             // 0x0138(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseReplaceByLocation;                                    // 0x0139(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bUseReplaceByRotation;                                    // 0x013A(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1];                                       // 0x013B(0x0001) MISSED OFFSET
	float                                              ReplaceLocationThreashold;                                // 0x013C(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              ReplaceRotationThereashold;                               // 0x0140(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData02[0xC];                                       // 0x0144(0x000C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRFramework.VRDynamicHelperComponent");
		return ptr;
	}


	void OnWake(class UPrimitiveComponent* WakingComponent, const struct FName& BoneName);
	void OnSleep(class UPrimitiveComponent* SleepingComponent, const struct FName& BoneName);
};


// Class VRFramework.VRGameMode
// 0x0000 (0x0410 - 0x0410)
class AVRGameMode : public AGameMode
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRFramework.VRGameMode");
		return ptr;
	}

};


// Class VRFramework.VRGrabComponent
// 0x0008 (0x00F8 - 0x00F0)
class UVRGrabComponent : public UActorComponent
{
public:
	bool                                               bSoftConstraint;                                          // 0x00F0(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x00F1(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRFramework.VRGrabComponent");
		return ptr;
	}

};


// Class VRFramework.VRGrabInterface
// 0x0000 (0x0028 - 0x0028)
class UVRGrabInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRFramework.VRGrabInterface");
		return ptr;
	}


	bool UseSoftGrabConstraint();
	void UnGrabbed(class AVRController* Controller);
	void Grabbed(class AVRController* Controller);
};


// Class VRFramework.VRItem
// 0x01A8 (0x04D0 - 0x0328)
class AVRItem : public AActor
{
public:
	class USceneComponent*                             PickComponent;                                            // 0x0328(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0330(0x0018) MISSED OFFSET
	class AVRItem*                                     LastReceviedParent;                                       // 0x0348(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      LastReceviedParentSlot;                                   // 0x0350(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x0351(0x0007) MISSED OFFSET
	class AVRItemController*                           LastReceviedController;                                   // 0x0358(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x50];                                      // 0x0360(0x0050) MISSED OFFSET
	class AVRItemController*                           Controller;                                               // 0x03B0(0x0008) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	class AVRItem*                                     Parent;                                                   // 0x03B8(0x0008) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      ParentSlot;                                               // 0x03C0(0x0001) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x7];                                       // 0x03C1(0x0007) MISSED OFFSET
	struct FVRItemState                                ItemState;                                                // 0x03C8(0x0018) (Net, ZeroConstructor, IsPlainOldData)
	class UVRSelectionComponent*                       SelectionComponent;                                       // 0x03E0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	bool                                               bPhysicsAwake;                                            // 0x03E8(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bInventoryDisabled;                                       // 0x03E9(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bMutePickSound;                                           // 0x03EA(0x0001) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               bPickDisabled;                                            // 0x03EB(0x0001) (BlueprintVisible, Net, ZeroConstructor, IsPlainOldData)
	float                                              BlockDuration;                                            // 0x03EC(0x0004) (BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData)
	bool                                               bCanBePocketed;                                           // 0x03F0(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bAllowGrabByGrip;                                         // 0x03F1(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bAllowPickByTrigger;                                      // 0x03F2(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bAllowPickByGrip;                                         // 0x03F3(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData04[0x4];                                       // 0x03F4(0x0004) MISSED OFFSET
	class USoundCue*                                   PickSound;                                                // 0x03F8(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bAutoPickOffset;                                          // 0x0400(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData05[0x7];                                       // 0x0401(0x0007) MISSED OFFSET
	struct FName                                       PickSpaceComponent;                                       // 0x0408(0x0008) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              DropImpulseMul;                                           // 0x0410(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bFlipRollPick;                                            // 0x0414(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bFlipYawPick;                                             // 0x0415(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bFlipYAxisPick;                                           // 0x0416(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData06[0x1];                                       // 0x0417(0x0001) MISSED OFFSET
	struct FVector                                     PickOffset;                                               // 0x0418(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    PickRotationOffset;                                       // 0x0424(0x000C) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	class UAnimSequence*                               Sequence;                                                 // 0x0430(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	float                                              SelfDestroyDelay;                                         // 0x0438(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bNerverDestroyForInactivity;                              // 0x043C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               bDestroyChildren;                                         // 0x043D(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData07[0x2];                                       // 0x043E(0x0002) MISSED OFFSET
	struct FVector                                     AvatarHandOffset;                                         // 0x0440(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	struct FRotator                                    AvatarHandRotationOffset;                                 // 0x044C(0x000C) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	bool                                               bSkipSnapshot;                                            // 0x0458(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData08[0x7];                                       // 0x0459(0x0007) MISSED OFFSET
	struct FTransform                                  InventoryOffset;                                          // 0x0460(0x0030) (Edit, DisableEditOnInstance, IsPlainOldData)
	int                                                ForceSlot;                                                // 0x0490(0x0004) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData09[0x4];                                       // 0x0494(0x0004) MISSED OFFSET
	TArray<struct FVRCustomInventoryOffset>            CustomInventoryOffsets;                                   // 0x0498(0x0010) (Edit, ZeroConstructor, DisableEditOnInstance)
	unsigned char                                      UnknownData10[0x8];                                       // 0x04A8(0x0008) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnPicked;                                                 // 0x04B0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnDropped;                                                // 0x04C0(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class VRFramework.VRItem");
		return ptr;
	}


	void Used(bool bJustPicked);
	void Use();
	void SpawnPickSound(class AVRItemController* ByController);
	void ShouldSelfDestroy();
	void ShouldNotSelfDestroy();
	void SetController(class AVRItemController* NewController, bool bNetUpdate);
	void SetAttachParent(class AVRItem* Item, bool bNetUpdate, unsigned char Slot);
	void SelfDestroy();
	void Physicalize(bool bEnabled);
	void OnRep_Parent();
	void OnRep_ItemState();
	void OnRep_Controller();
	void OnPredictionTimeout();
	void OnPredictionCorrect();
	void OnPick(class AVRItemController* ByController);
	void OnPhysicsWake(class UPrimitiveComponent* SleepingComponent, const struct FName& BoneName);
	void OnPhysicsSleep(class UPrimitiveComponent* SleepingComponent, const struct FName& BoneName);
	void OnParentChanged(class AVRItem* ParentItem);
	void OnDrop();
	void MulticastUpdateState(class AVRItemController* RequestedController, class AVRItem* RequestedParent, unsigned char RequestedParentSlot);
	void MulticastStateSanityCheck();
	void MakeDormant();
	bool IsBlocked();
	struct FTransform GetSequenceTransform();
	void DestroyNow();
	void Cycle();
	bool CanGetPickedBy(class AVRItemController* ByController);
};


// Class VRFramework.VRGun
// 0x03A0 (0x0870 - 0x04D0)
class AVRGun : public AVRItem
{
public:
	bool                                               bInvertRollRecoil;                                        // 0x04D0(0x0001) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x04D1(0x0003) MISSED OFFSET
	float                                              RecoilRatio;                                              // 0x04D4(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              ReloadCooldown;                                           // 0x04D8(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x34];                                      // 0x04DC(0x0034) MISSED OFFSET
	float                                              BasisBlendAlpha;                                          // 0x0510(0x0004) (ZeroConstructor, IsPlainOldData)
	struct FVector                                     DynamicRecoil;                                            // 0x0514(0x000C) (ZeroConstructor, Transient, IsPlainOldData)
	struct FVector                                     DynamicRecoilSaved;                                       // 0x0520(0x000C) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              CounterRecoilTimer;                                       // 0x052C(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              DynamicPivotRecoil;                                       // 0x0530(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              DynamicPivotRecoilSaved;                                  // 0x0534(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              CounterPivotRecoilTimer;                                  // 0x0538(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	float                                              BoltReleaseTimer;                                         // 0x053C(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x28];                                      // 0x0540(0x0028) MISSED OFFSET
	int                                                BurstCount;                                               // 0x0568(0x0004) (ZeroConstructor, IsPlainOldData)
	float                                              BurstDelayTimer;                                          // 0x056C(0x0004) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x8];                                       // 0x0570(0x0008) MISSED OFFSET
	struct FVRGunStateProxy                            StateProxy;                                               // 0x0578(0x0010) (Net)
	unsigned char                                      UnknownData04[0x38];                                      // 0x0588(0x0038) MISSED OFFSET
	class UParticleSystemComponent*                    MuzzleFlashComp;                                          // 0x05C0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData05[0x10];                                      // 0x05C8(0x0010) MISSED OFFSET
	class UVRGunState*                                 State;                                                    // 0x05D8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	class APlayerController*                           PreviousOwner;                                            // 0x05E0(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UVRHandleComponent*                          ChargingHandle;                                           // 0x05E8(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              FireRateTimer;                                            // 0x05F0(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              Recoil;                                                   // 0x05F4(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	float                                              SlideTimer;                                               // 0x05F8(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bBoltLocked;                                              // 0x05FC(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bTriggered;                                               // 0x05FD(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               bTriggerSnapped;                                          // 0x05FE(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData06[0x1];                                       // 0x05FF(0x0001) MISSED OFFSET
