#pragma once

// PavlovVR (Dumped by Hinnie) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
//Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct S_SkinInfo.S_SkinInfo
// 0x0028
struct FS_SkinInfo
{
	struct FName                                       Weapon_11_620F75524C6C6C0F8525B7975B81A24E;               // 0x0000(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UTexture2D*                                  MenuIcon_15_08D8FE5941BDD50186F5699298F319A6;             // 0x0008(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           MainMaterial_4_068CF59E4CFE3CD1490694A8CAA8BDA7;          // 0x0010(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           MinorMaterial1_6_588ECFAD46EF63E529F801BD4E14BAA9;        // 0x0018(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class UMaterialInstance*                           MinorMaterial2_8_044186254F2A1BD3BAD79AB373A825A3;        // 0x0020(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
